Repository: 84000/data-translation-memory
Catalog: Toh_157-The_Questions_of_the_Kimnara_King_Druma-v2.tmx
Source language: bo
Languages: en

source: ཐམས་ཅད་ཀྱང་བརྩོན་འགྲུས་བརྩམས་པ། བཟོད་པ་རབ་ཏུ་ཐོབ་པ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པ་ཤ་སྟག་གོ། །
en: They were all diligent, they had all reached acceptance, all of them had attained irreversible progress toward unsurpassed and perfect awakening, and

source: དེའི་ཚེའི་ཚད་ནི་ལོ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་ཐུབ་པར་གྱུར་ཏོ། །
en: their lifespan stretched over six hundred million years.

source: དགེ་བ་ཞེས་བྱ་བའི་འཇིག་རྟེན་གྱི་ཁམས་དེ་ཡང་(བཻདཱུརྱ་,བཻ་ཌཱུརྱ་)ལས་གྲུབ་པ། རྒྱན་ཐམས་ཅད་ཀྱིས་བརྒྱན་པ། རྣམ་པའི་མཆོག་ཐམས་ཅད་དང་ལྡན་པ་དགའ་ལྡན་གྱི་ལྷའི་རིས་ལྟ་བུར་ཁང་ཁྱིམ་དང་། ལོངས་སྤྱོད་དང་། ཉེ་བར་སྤྱོད་པ་དང་། བཟའ་བ་དང་། བཏུང་བ་བསམས་པ་ཙམ་གྱིས་འབྱོར་པའོ། །
en: That universe, Śubhā, was made of beryl and adorned with all possible types of ornaments. Just as in the divine abode of the Heaven of Joy, that realm had all the most sublime features, and all houses, possessions, pleasures, food, and beverages manifested just by thinking of them.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་ཐེག་པ་ཆེན་པོ་མ་གཏོགས་པར་ཐེག་པ་གཞན་རྣམ་པར་གཞག་པ་མེད་པར་གྱུར་ཏོ། །
en: In that buddha realm, everyone without exception was settled within the Great Vehicle and nowhere else.

source: རིགས་ཀྱི་བུ་དེའི་ཚེ་དེའི་དུས་ན་གླིང་བཞི་ལ་དབང་བའི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོས་འཛིན་ཅེས་བྱ་བ་རིན་པོ་ཆེ་སྣ་བདུན་དང་ལྡན་པ་ཞིག་བྱུང་སྟེ།
en: “Noble son, at that time, a universal monarch called Nimiṃdhara, who ruled over the four continents and was endowed with the seven precious attributes, appeared in the world.

source: དེའི་སླས་ནི་སྟོང་ཕྲག་བཞི་བཅུ་ཡོད་དོ། །
en: He had forty thousand queens, and [one thousand sons that were all brave, courageous, and possessed the most handsome physiques and the power to overcome their opponents.]

source: དེའི་བུ་ནི་སྟོང་ཐམ་པ་ཡོད་དེ། དཔའ་བ། རྟུལ་ཕོད་པ། ཡན་ལག་མཆོག་གི་གཟུགས་ཅན་ཕ་རོལ་གྱི་སྡེ་རབ་ཏུ་འཇོམས་པ་ཤ་སྟག་གོ། །
en: He had [forty thousand queens, and ]one thousand sons that were all brave, courageous, and possessed the most handsome physiques and the power to overcome their opponents.

source: རིགས་ཀྱི་བུ་རྒྱལ་པོས་འཛིན་དེས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཕུང་པོ་དེ་དང་། བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཕྲག་དྲུག་ཅུ་ལ་ལོ་བྱེ་བ་ཐམ་པར་ཡིད་དུ་འོང་བའི་ཆོས་གོས་དང་། ཞལ་ཟས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་དང་། བདེ་བར་སྦྱར་བ་བདེ་བ་ལ་རེག་པར་གནས་པར་བྱ་བ་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་ནས་དེས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཕུང་པོ་དེ་ལ་མཆོད་པ་དཔག་ཏུ་མེད་པ་བྱས་ཏེ
en: Noble son, the king Nimiṃdhara worshiped the Thus-Gone One Ratnaskandha in a boundless manner, revering him and his six hundred million bodhisattvas for ten million years with offerings of beautiful Dharma robes, food, bedding, medicine, provisions, and every other type of pleasing article.

source: དགེ་བའི་རྩ་བས་ཉེ་བར་བརྟན་ནས་
en: Supported by those roots of virtue,

source: བུད་མེད་བཞི་སྟོང་པོ་དེ་དག་དང་། བུ་སྟོང་པོ་དེ་དག་དང་། སྲོག་ཆགས་བརྒྱད་ཁྲི་བཞི་སྟོང་དང་ལྷན་ཅིག་ཏུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: he gave rise to the mind set on unsurpassed and perfect awakening together with his forty thousand women, one thousand sons, and eighty-four thousand other beings.

source: དེས་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་ནས་ཀྱང་ལོ་བྱེ་བར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཕུང་པོ་དེ་ལ་བསྙེན་བཀུར་བྱས་སོ། །
en: Then, they venerated the Blessed One, the Thus-Gone One Ratnaskandha, for ten million years.

source: དེ་དུས་གཞན་ཞིག་ན་བུ་ཐུ་བོ་བརྟུལ་ཞུགས་ཡོངས་སུ་དག་པ་ཞེས་བྱ་བ་རྒྱལ་པོར་བཅུག་ནས་རྒྱལ་སྲིད་ཐམས་ཅད་བོར་ཏེ། སྐྲ་དང་ཁ་སྤུ་བྲེགས་ནས་གོས་ངུར་སྨྲིག་བགོས་ཏེ་བཅོམ་ལྡན་འདས་དེའི་བསྟན་པ་ལ་དད་པས་ཁྱིམ་ནས་ཁྱིམ་མེད་པར་རབ་ཏུ་བྱུང་ངོ་། །
en: Later on, when his eldest son named Vratapariśuddha was enthroned, he relinquished his kingdom, shaved his head and cut his beard, put on the saffron-colored Dharma robes, and with trust went forth from the household into homelessness under that blessed one’s teaching.

source: དེ་ན་རྒྱལ་པོའི་བུ་དེ་དག་གིས་ཀྱང་རིམ་གྱིས་བུ་ཐུ་བོ་རེ་རེ་རྒྱལ་པོར་བཅུག་ནས་ཕའི་རྗེས་སུ་རབ་ཏུ་བྱུང་བར་གྱུར་ཏོ། །
en: Then, as each prince following in the line of succession became enthroned, the elder sons followed the example of their father and went forth, one after the other.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་རྣམ་གྲངས་འདིས་དེ་བཞིན་གཤེགས་པ་དེའི་ཚེའི་ཚད་རིང་བར་གྱུར་ཏོ། །
en: Noble son, such was the length of the Thus-Gone One’s lifespan.

source: རྒྱལ་པོ་གཞོན་ནུ་དེ་དག་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པ་དེ་ལས་རབ་ཏུ་བྱུང་ནས་
en: After all those princes had gone forth under that thus-gone one,

source: རྒྱལ་བུ་གཞོན་ནུ་ཐ་ཆུང་ས་སྙིང་རྗེའི་བློ་ཞེས་བྱ་བ་གཅིག་པུ་མ་གཏོགས་ཏེ། དེ་ནི་ཆོས་ཀྱིས་རྒྱལ་སྲིད་བྱེད་པ་ཆད་པ་མེད་པ་དང་། མཚོན་ཆ་མེད་པར་ཆོས་དང་འཐུན་པར་དབང་བྱེད་དུ་བཅུག་གོ། །
en: they enthroned the youngest son named Karuṇāmati to govern the kingdom leniently in accordance with the Dharma, without using any weapons.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་རྒྱལ་པོ་ས་འཛིན་དེ་བུ་དང་བཅས་པར་བཅོམ་ལྡན་འདས་དེའི་བསྟན་པ་ལ་རབ་ཏུ་བྱུང་ནས་
en: Noble son, in that way, the king Nimiṃdhara and his sons went forth under the teachings of that blessed one and,

source: ཐོག་མ་དང་བར་མ་དང་ཐ་མར་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཕུང་པོ་དེའི་དམ་པའི་ཆོས་རབ་ཏུ་བཟུང་ངོ་། །
en: during the beginning, the middle, and the end of their lives, they always upheld the sacred Dharma of the Thus-Gone One Ratnaskandha.

source: རིགས་ཀྱི་བུ་དེའི་ཚེ་དེའི་དུས་ན་གླིང་བཞི་ལ་དབང་བའི་འཁོར་ལོས་སྒྱུར་བའི་རྒྱལ་པོ་ས་འཛིན་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་ཁྱོད་དོགས་ཤིང་ཐེ་ཙོམ་ཟའམ་ཡིད་གཉིས་སུ་གྱུར་པ་ལྟ་ན་རིགས་ཀྱི་བུ་ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟའོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན། མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོ་འདི་དེའི་ཚེ་དེའི་དུས་ན་རྒྱལ་པོ་ས་འཛིན་ཞེས་བྱ་བར་གྱུར་ཏོ། །
en: “Noble son, at that time, the kiṃnara king Druma was born as the king Nimiṃdhara—that universal monarch ruling over the four continents. Noble son, do not be skeptical, do not have any hesitation or doubts about that fact, thinking that this was someone else.

source: རྒྱལ་པོ་དེའི་བུར་གྱུར་པ་དེ་དག་ཐམས་ཅད་ནི་དེ་ལྟར་ཕྱོགས་བཅུ་ན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་དོ། །
en: All those princes are now practicing bodhisattva conduct in the ten directions.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ན་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་ཆེན་ཕུང་པོ་དེ་ལས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: Noble son, the kiṃnara king Druma thus gave rise to the mind set on unsurpassed and perfect awakening under the Blessed One, the Thus-Gone One Ratnaskandha.

source: དེ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་དང་པོ་སེམས་བསྐྱེད་ཚུན་ཆད། དའི་བར་ཐམས་ཅད་དུ་སངས་རྒྱས་མཐོང་བ་དང་ཆོས་ཉན་པ་དང་། དགེ་འདུན་ལ་རིམ་གྲོ་བྱེད་པ་དང་མ་བྲལ་བར་གྱུར་ཏོ། །
en: From the moment he gave rise to the mind set upon unsurpassed and perfect awakening up until today, he has met buddhas, listened to the Dharma, and revered the Saṅgha without interruption.

source: འདིས་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཀྱི་ཚོགས་ཀྱང་མྱུར་དུ་ཡང་དག་པར་བསྒྲུབས་པས་འདི་ལ་ངས་འདི་ནི་མ་འོངས་པའི་དུས་ན་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཡོན་ཏན་གྱི་རྒྱལ་པོར་སྣང་བ་ཞེས་བྱ་བར་འགྱུར་རོ་ཞེས་ལུང་ཡང་བསྟན་ཏོ། །
en: For this reason, since he has swiftly and genuinely accomplished the accumulations for perfect awakening, I have prophesied today that, in the future, he will become the Thus-Gone One, the worthy one, the perfect Buddha called Guṇarāja­prabhāsa.”

source: བཅོམ་ལྡན་འདས་ཇི་ཙམ་དུ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཐོགས་པ་མི་མངའ་བའི་མཁྱེན་པ་དང་ལྡན་པས་འདི་ལྟར་དགེ་བའི་རྩ་བ་མངོན་པར་འདུས་བགྱིས་པའི་རྒྱུ་བ་ནས་ཡུན་རིང་དུ་ལགས་པ་ཡང་བཅོམ་ལྡན་འདས་ཀྱིས་སྒྲིབ་པ་མི་མངའ་བའི་མཁྱེན་པས་གཟིགས་པ་ནི་ངོ་མཚར་ཏོ། །
en: “Blessed One, you possess the unimpeded wisdom of the thus-gone ones, the worthy ones, the perfect buddhas. Although those roots of virtue were formed a long time ago, you perceive this through your unobscured wisdom. This is amazing!”

source: རིགས་ཀྱི་བུ་དེ་དེ་བཞིན་ནོ། །
en: “Thus it is, noble son,”

source: ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་ཏེ།
en: “as you have said,

source: དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་མཐོང་བ་དང་ལྡན་ནོ། །
en: the Thus-Gone One, the worthy one, the perfect Buddha possesses unimpeded wisdom vision.

source: !རིགས་ཀྱི་བུ་གང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་འདས་པའི་སེམས་ཀྱི་རྒྱུ་ཟད་པ། འགགས་པ། བྲལ་བ། རྣམ་པར་གྱུར་པ། རྒྱུ་གང་དག་ལས་སེམས་ཀྱི་རྒྱུད་དེ་དག་བྱུང་བ་དང་། རྒྱུ་གང་དག་མེད་པས་ཟད་པ། དགེ་བའམ། མི་དགེ་བའམ། ལུང་དུ་བསྟན་པའམ། ལུང་དུ་མ་བསྟན་པ་དེ་དག་ཐམས་ཅད་རྣམ་པ་དང་བཅས། གཞི་དང་བཅས། གཏན་ཚིགས་དང་བཅས་པར་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་ཤེས་སོ། །
en: Because, noble son, the Thus-Gone One clearly knows the exhaustion, cessation, separation, and transformation of the past mindstreams of all beings; he knows from which causes their mindstreams emerged and the absence of causes through which they became exhausted, as well as all their virtuous, nonvirtuous, specified, and unspecified mental states with all their features, foundations, and circumstances.

source: ད་ལྟར་བྱུང་བའི་དུས་ཀྱི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་རྒྱུད་བྱུང་བ་དགེ་བའམ། མི་དགེ་བའམ། ལུང་དུ་བསྟན་པའམ། ལུང་དུ་མ་བསྟན་པ་ཡང་རུང་སྟེ། སེམས་རང་གི་འོག་ཏུ་སེམས་གང་བྱུང་བ་དེ་དག་ཐམས་ཅད་ཀྱང་རྣམ་པ་དང་བཅས། གཞི་དང་བཅས། གཏན་ཚིགས་དང་བཅས་པར་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་ཤེས་སོ། །
en: The Thus-Gone One clearly knows the present mindstreams of all beings and all the virtuous, nonvirtuous, specified, and unspecified mental states that arise in them; he knows the sequence of all those mental states with all their features, foundations, and circumstances.

source: གང་མ་འོངས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་སེམས་ཀྱི་རྒྱུད་དང་སེམས་ལས་བྱུང་བའི་ཆོས་དགེ་བའམ། མི་དགེ་བའམ། ལུང་དུ་བསྟན་པའམ། ལུང་དུ་མ་བསྟན་པ་ཡང་རུང་སྟེསེམས་གང་གི་འོག་ཏུ་སེམས་གང་འབྱུང་བར་འགྱུར་བ་དེ་དག་ཐམས་ཅད་ཀྱང་རྣམ་པ་དང་བཅས། གཞི་དང་བཅས་པ། གཏན་ཚིགས་དང་བཅས་པར་དེ་བཞིན་གཤེགས་པས་རབ་ཏུ་ཤེས་སོ། །
en: The Thus-Gone One clearly knows the future mindstreams of all sentient beings and all the virtuous, nonvirtuous, specified, and unspecified mental states that will arise in them; he knows the sequence of all those mental states with all their features, foundations, and circumstances.

source: རིགས་ཀྱི་བུ་དེ་ལྟར་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ནི་ཐོགས་པ་མེད་པའི་ཡེ་ཤེས་དང་ལྡན་ནོ། །
en: Noble son, this is how the Thus-Gone One, the worthy one, the perfect Buddha possesses unimpeded wisdom vision.”

source: དེ་བཞིན་གཤེགས་པའི་མཁྱེན་པ་ཐོགས་པ་མི་མངའ་བ་བསྟན་པ་འདི་བཤད་པ་ན་སྲོག་ཆགས་སུམ་འབུམ་གྱིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དོ། །
en: When this teaching on the unimpeded wisdom of the Thus-Gone One was expounded, three hundred thousand beings gave rise to the mind set on unsurpassed and perfect awakening.

source: དེ་ནས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའ་དང་ཉན་ཐོས་ཀྱི་དགེ་འདུན་གྱི་འཁོར་དང་བཅས་པ་ལ་ཞག་བདུན་བདེ་བར་སྦྱར་བ་ཐམས་ཅད་ཀྱིས་བསྙེན་བཀུར་བྱས་ནས་
en: Then, after the kiṃnara king Druma had revered the Blessed One and his saṅghas of bodhisattvas and hearers for seven days by offering them all types of pleasing articles,

source: ཡོངས་སུ་ལོངས་སྤྱད་པར་བྱ་བའི་ཕྱིར་རང་གི་ཁང་ཁྱིམ་དང་། འཁོར་གྱི་ཁྱམས་དེ་ཡང་བཅོམ་ལྡན་འདས་ལ་ཕུལ་ཏེ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: he offered his own home and courtyard to the Blessed One for his use and said,

source: བཅོམ་ལྡན་འདས་བདག་ལ་ཐུགས་བརྩེ་བའི་སླད་དུ་རྟག་ཏུ་འདིར་གཤེགས་ཤིང་བཞུགས་པར་གསོལ།
en: “Blessed One, please always come and stay in this place out of love for me!

source: དེས་ན་སྐྱེ་བོ་མང་པོ་ལ་ཕན་པ་དང་། སྐྱེ་བོ་མང་པོ་ལ་བདེ་བ་དང་། འཇིག་རྟེན་ལ་ཐུགས་བརྩེ་བ་དང་། སྐྱེ་བོའི་ཚོགས་ཕལ་པོ་ཆེའི་དོན་དང་། མི་འམ་ཅི་དང་། དྲི་ཟ་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་རྣམས་ལ་ཕན་པ་དང་བདེ་བར་འགྱུར་རོ། །
en: By doing so, you will assist and bring happiness to many beings, you will show your love for the world, you will benefit a huge number of beings, and you will bring benefit and happiness to the kiṃnaras, the gandharvas, and the mahoragas.”

source: དེ་ནས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོའི་བུ་དྲི་མ་མེད་པའི་མིག་ཅེས་བྱ་བས་བཅོམ་ལྡན་འདས་ལ་ནོར་བུ་རིན་པོ་ཆེའི་དྲ་བ་ཕུལ་ནས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Then, the son of the kiṃnara king Druma called Vimalanetra offered a net of precious gems to the Blessed One and made this request:

source: བཅོམ་ལྡན་འདས་མི་འམ་ཅི་བདག་ཅག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་ཡང་དག་པར་ཞུགས་སུ་ལགས་ཀྱང་བདག་ཅག་ནི་སིལ་སྙན་དང་རོལ་མོའི་དབྱངས་སྒྲ་དང་། གླུ་དང་གར་ལ་རབ་ཏུ་ཆགས།
en: “Blessed One, although we, the kiṃnaras, are on the path to unsurpassed and perfect awakening, we remain strongly attached to our music and the tunes of our instruments, as well as to song and dance, and

source: མེ་ཏོག་དང་སྤོས་དང་བདུག་པ་དང་བྱུག་པ་དང་། ཕྱེ་མ་ལ་བག་མ་མཆིས་པར་དགའ་ཞིང་རྩེ་བ་ལགས་ན་ཇི་ལྟར་བདག་ཅག་བག་མཆིས་པར་འགྱུར་ཞིང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་ཡང་དག་པར་བསྒྲུབ་པར་འགྱུར་བ་དེ་ལྟ་བུའི་ཆོས་རིན་པོ་ཆེའི་ཕྱག་རྒྱའི་སྒོའི་གདམས་ངག་བཅོམ་ལྡན་འདས་ཀྱིས་བདག་ཅག་ལ་སྩལ་བར་གསོལ།
en: we carelessly enjoy and frolic with flowers, perfumes, incense, ointments, and powders. Blessed One, please grant us the instruction on the gateway of the seal of the precious Dharma, so that we may develop carefulness and accomplish the factors of awakening!”

source: བཅོམ་ལྡན་འདས་ཀྱིས་མི་འམ་ཅིའི་རྒྱལ་པོའི་བུ་དྲི་མ་མེད་པའི་མིག་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One replied to the kiṃnara prince Vimalanetra,

source: བཞིན་བཟངས་དག་དེའི་ཕྱིར་དེང་ཕྱིན་ཅད་སིལ་སྙན་དང་གླུ་དབྱངས་དེ་དག་ལས་བྱང་ཆུབ་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ཆོས་དྲུག་ཅུ་རྩ་བཞི་འབྱུང་བར་ཁྱེད་ལ་བྱིན་གྱིས་བརླབ་པར་བྱའོ། །
en: “Good man, I will bless you so that, from now on, sixty-four factors that will ripen you for awakening will manifest from the tunes of your instruments and your songs.

source: དྲུག་ཅུ་རྩ་བཞི་གང་ཞེ་ན།
en: What are those sixty-four?

source: འདི་ལྟ་སྟེ། མི་རྟག་པའི་སྒྲ་འབྱུང་བ་དང་། སྡུག་བསྔལ་གྱི་སྒྲ་དང་། བདག་མེད་པའི་སྒྲ་དང་། ཞི་བའི་སྒྲ་དང་། མངོན་པར་འདུ་མི་བྱེད་པའི་སྒྲ་དང་། དབེན་པའི་སྒྲ་དང་། མི་སྐྱེ་བའི་སྒྲ་དང་། དངོས་པོ་མེད་པའི་སྒྲ་དང་། འབྱུང་བ་མེད་པའི་སྒྲ་དང་། གནས་མེད་པའི་སྒྲ་དང་། ཇི་ལྟ་བ་བཞིན་གྱི་སྒྲ་དང་། ཡང་དག་པའི་མཐའི་སྒྲ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་སྒྲ་དང་། སེམས་ཅན་མེད་པའི་སྒྲ་དང་། སྲོག་མེད་པའི་སྒྲ་དང་། གང་ཟག་མེད་པའི་སྒྲ་དང་། སྦྱིན་པའི་སྒྲ་དང་། ཚུལ་ཁྲིམས་ཀྱི་སྒྲ་དང་། བཟོད་པའི་སྒྲ་དང་། བརྩོན་འགྲུས་ཀྱི་སྒྲ་དང་། བསམ་གཏན་གྱི་སྒྲ་དང་། ཤེས་རབ་ཀྱི་སྒྲ་དང་། བྱམས་པའི་སྒྲ་དང་། སྙིང་རྗེའི་སྒྲ་དང་། དགའ་བའི་སྒྲ་དང་། བཏང་སྙོམས་ཀྱི་སྒྲ་དང་། འོང་བ་མེད་པའི་སྒྲ་དང་། འགྲོ་བ་མེད་པའི་སྒྲ་དང་། རྒྱུ་བ་མེད་པའི་སྒྲ་དང་། གནས་མེད་པའི་སྒྲ་དང་། བརྟན་པ་མེད་པའི་སྒྲ་དང་། སྟོང་པ་ཉིད་ཀྱི་སྒྲ་དང་། མཚན་མ་མེད་པའི་སྒྲ་དང་། སྨོན་པ་མེད་པའི་སྒྲ་དང་། འདོད་ཆགས་དང་བྲལ་བའི་སྒྲ་དང་། འབྱུང་བ་མེད་པའི་སྒྲ་དང་། རྟེན་པའི་སྒྲ་དང་། རྟེན་པ་མེད་པའི་སྒྲ་དང་། སངས་རྒྱས་ཀྱི་སྒྲ་དང་། ཆོས་ཀྱི་སྒྲ་དང་། དགེ་འདུན་གྱི་སྒྲ་དང་། བྱང་ཆུབ་ཚད་མེད་པའི་སྒྲ་དང་། དྲན་པ་ཉེ་བར་གཞག་པའི་སྒྲ་དང་། ཡང་དག་པར་སྤོང་བའི་སྒྲ་དང་། རྫུ་འཕྲུལ་གྱི་རྐང་པའི་སྒྲ་དང་། དབང་པོའི་སྒྲ་དང་། སྟོབས་ཀྱི་སྒྲ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་སྒྲ་དང་། ལམ་གྱི་སྒྲ་དང་། ཞི་གནས་ཀྱི་སྒྲ་དང་། ལྷག་མཐོང་གི་སྒྲ་དང་། ཐབས་ཀྱི་སྒྲ་དང་། བསྡུ་བའི་དངོས་པོའི་སྒྲ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱ་བའི་སྒྲ་དང་། བདུད་ཚར་གཅད་པའི་སྒྲ་དང་། དམ་པའི་ཆོས་ཡོངས་སུ་གཟུང་བའི་སྒྲ་དང་། ཆོས་ཐམས་ཅད་སྒྱུ་མ་དང་། རྨི་ལམ་དང་། གཟུགས་བརྙན་དང་། ཆུའི་ཟླ་བ་དང་། བྲག་ཅ་ལྟ་བུའི་སྒྲ་དང་། ཆོས་ཀྱི་དབྱིངས་འདྲེས་པ་མེད་པའི་སྒྲ་དང་། འཁོར་བས་ཡོངས་སུ་མི་སྐྱོ་བའི་སྒྲ་དང་། འབྱུང་བའི་སྒྲ་དང་། དགེ་བའི་རྩ་བའི་ཚོགས་ཐམས་ཅད་ཀྱི་སྒྲ་དང་། དབུ་བ་དང་། ཆུའི་ཆུ་བུར་དང་། སྨིག་རྒྱུ་དང་། ཆུ་ཤིང་གི་ཕུང་པོ་དང་། སྒྱུ་མ་དང་། སྙིང་པོ་མེད་པའི་སྒྲ་དང་། ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་དུ་བྱ་ཞིང་ཆོས་བསྒྲུབ་པའི་སྒྲ་འབྱུང་བར་འགྱུར་རོ། །
en: They are (1) the sound of impermanence, (2) the sound of suffering, (3) the sound of selflessness, (4) the sound of peace, (5) the sound of the absence of formation, (6) the sound of detachment, (7) the sound of the absence of arising, (8) the sound of insubstantiality, (9) the sound of the absence of origination, (10) the sound of the absence of abiding, (11) the sound of reality, (12) the sound of the limit of reality, (13) the sound of the realm of phenomena, (14) the sound of the absence of a sentient being, (15) the sound of the absence of a life principle, (16) the sound of the absence of a person, (17) the sound of generosity, (18) the sound of discipline, (19) the sound of patience, (20) the sound of diligence, (21) the sound of concentration, (22) the sound of insight, (23) the sound of love, (24) the sound of compassion, (25) the sound of joy, (26) the sound of equanimity, (27) the sound of the absence of coming, (28) the sound of the absence of going, (29) the sound of the absence of movement, (30) the sound of groundlessness, (31) the sound of baselessness, (32) the sound of emptiness, (33) the sound of the absence of marks, (34) the sound of the absence of wishes, (35) the sound of the freedom from desire, (36) the sound of the absence of manifestation, (37) the sound of reliance, (38) the sound of nonreliance, (39) the sound of the Buddha, (40) the sound of the Dharma, (41) the sound of the Saṅgha, (42) the sound of boundless awakening, (43) the sound of the applications of mindfulness, (44) the sound of the true relinquishments, (45) the sound of the bases of miraculous display, (46) the sound of the strengths, (47) the sound of the powers, (48) the sound of the branches of awakening, (49) the sound of the path, (50) the sound of tranquility, (51) the sound of special insight, (52) the sound of methods, (53) the sound of the means to attract disciples, (54) the sound of the maturation of beings, (55) the sound of the subjugation of Māra, (56) the sound of the embrace of the sacred Dharma, (57) the sound of all phenomena being like illusions, dreams, reflections, reflections of the moon in water, and echoes, (58) the sound of the unadulterated realm of phenomena, (59) the sound of not being weary with saṃsāra, (60) the sound of manifestation, (61) the sound of the accumulation of all roots of virtue, (62) the sound of foam, water bubbles, mirages, plantain trees, illusion, and insubstantiality, (63) the sound of actions that accord with one’s words, and (64) the sound of accomplishing the Dharma.

source: བཞིན་བཟངས་དག་དེ་ལྟར་ན་སངས་རྒྱས་ཀྱི་མཐུས་སིལ་སྙན་དང་གླུ་དབྱངས་དེ་དག་ལས་གང་གི་ཁྱེད་བག་ཡོད་པར་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་བསྒྲུབ་པར་འགྱུར་བ་དེ་ལྟ་བུའི་སྒྲ་འདི་དག་འབྱུང་བར་འགྱུར་རོ།། །།
en: Good man, those are the sounds that will manifest from the instruments and songs through the power of the Buddha, causing you to carefully accomplish the factors of awakening.”

source: དེ་ནས་ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་ངོ་མཚར་དུ་གྱུར་ནས་བཅོམ་ལྡན་འདས་ལ་ཕྱག་འཚལ་ཏེ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Amazed, the entire retinue prostrated to the Blessed One and exclaimed,

source: བཅོམ་ལྡན་འདས་ཇི་ཙམ་དུ་སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱང་བྱང་ཆུབ་འདི་བྱིན་གྱི་རླབས་ཀྱིས་ཤིན་ཏུ་བྱིན་གྱིས་བརླབས་པ་དང་། ཆོས་བསྟན་པ་དང་། ཇི་ཙམ་དུ་དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཤིན་ཏུ་ཡོངས་སུ་བཟུང་བ་ནི་ངོ་མཚར་ཏོ། །
en: “Blessed One, the way the blessed buddhas grant their blessings toward awakening, the way they teach the Dharma, and the way the Thus-Gone One looks after the bodhisattvas is amazing!”

source: གྲོགས་པོ་དག་ཇི་སྐད་སྨྲས་པ་དེ་བཞིན་ཏེ།
en: “Very well said, my friends,”

source: དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཤིན་ཏུ་ཡོངས་སུ་བཟུང་ངོ་། །
en: “the Thus-Gone One looks after the bodhisattvas.

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་བཟུང་བས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བཟུང་བར་འགྱུར་རོ། །
en: Because, by looking after the bodhisattvas, he looks after all beings.

source: གྲོགས་པོ་དག་དེ་བཞིན་གཤེགས་པས་བྱང་ཆུབ་སེམས་དཔའ་ཡོངས་སུ་བཟུང་བ་གང་ཡིན་པ་དེ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དོན་ཉིད་དོ། །
en: Friends, when the Thus-Gone One looks after the bodhisattvas, that accomplishes the benefit of all beings.

source: དེ་ལྟར་ན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཆེད་དུ་དེ་དག་གོ་ཆ་གང་གིས་སེམས་ཅན་ཚད་མེད་གྲངས་མེད་པ་འཁོར་བ་ལས་མྱ་ངན་ལས་འདའ་བའི་ལམ་དུ་གཟུད་པར་འགྱུར་བའི་གོ་ཆ་ཆེན་པོ་གྱོན་ནོ། །
en: It is for the sake of all beings that bodhisattvas put on the great armor with which they can lead a countless and limitless number of beings away from cyclic existence to the transcendence of suffering.

source: གྲོགས་པོ་དག་རྣམ་གྲངས་འདིས་འདི་ལྟ་རང་ད་ལྟར་བཞུགས་ཀྱང་རུང་ཡོངས་སུ་མྱ་ངན་ལས་འདས་ཀྱང་རུང་སྟེ། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཡོངས་སུ་བཟུང་བ་མཛད་པ་གང་ཡིན་པ་དེས་སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་བཟུང་བ་ཡིན་པར་རིག་པར་བྱའོ། །
en: Friends, in this manner you should understand that, whether I am still alive or have passed beyond suffering, those who look after the bodhisattvas are looking after all beings.

source: གྲོགས་པོ་དག་བྱང་ཆུབ་སེམས་དཔའ་ལ་ཆོས་གོས་དང་། བསོད་སྙོམས་དང་། མལ་ཆ་དང་། ན་བའི་གསོས་སྨན་དང་། ཡོ་བྱད་རྣམས་ཀྱིས་རིམ་གྲོར་བྱས་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་རིམ་གྲོ་བྱས་པར་འགྱུར་རོ། །
en: Friends, those who serve the bodhisattvas by offering them Dharma robes, alms, bedding, medicine, and provisions serve all beings.

source: གྲོགས་པོ་དག་བྱང་ཆུབ་སེམས་དཔའ་ལ་བདེ་བར་སྦྱར་བ་ཉེ་བར་བསྒྲུབས་པ་ནི་སེམས་ཅན་ཐམས་ཅད་ལ་བདེ་བར་སྦྱར་བ་ཉེ་བར་བསྒྲུབས་པར་འགྱུར་རོ། །
en: Friends, those who provide pleasing articles to the bodhisattvas provide pleasing articles to all beings.

source: གྲོགས་པོ་དག་ཐ་ན་བྱང་ཆུབ་སེམས་དཔའི་དབུགས་འབྱུང་བ་དང་། རྔུབ་པ་གང་ཡིན་པ་དེ་ཐམས་ཅད་ཀྱང་སེམས་ཅན་ཐམས་ཅད་ལ་སྙིང་རྗེ་ཆེན་པོ་རབ་ཏུ་འཐོབ་པ་དང་ལྡན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་བདེ་བའི་ཕྱིར་ཡོངས་སུ་འཛིན་ཏོ། །
en: Friends, it is because even the mere breathing of bodhisattvas is done out of great compassion for all beings. They look after all beings for the sake of their benefit and happiness.”

source: དེ་ནས་འདོད་པ་ན་སྤྱོད་པ་དང་། གཟུགས་ན་སྤྱོད་པ་དང་། གནས་གཙང་མའི་རིས་ཀྱི་ལྷའི་བུ་དེ་དག་དང་། ཀླུ་དང་། གནོད་སྦྱིན་དང་། དྲི་ཟ་དང་། མི་འམ་ཅི་དང་། ལྟོ་འཕྱེ་ཆེན་པོ་དང་། ཐམས་ཅད་དང་ལྡན་པའི་འཁོར་དེ་བཅོམ་ལྡན་འདས་ཀྱིས་ལེགས་པར་གསུངས་པ་ལ་རྗེས་སུ་ཡི་རངས་ནས།
en: At that moment, the gods of the desire realm, the gods of the form realm, the gods of the pure realms, the nāgas, the yakṣas, the gandharvas, the kiṃnaras, the mahoragas, and the entire retinue rejoiced at the Blessed One’s well-spoken words, and

source: ལྷའི་མེ་ཏོག་རྣམ་པ་མང་པོ་ཁ་དོག་སྣ་ཚོགས་པས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་གཏོར་ཏོ། །
en: they showered him with many kinds of multicolored divine flowers.

source: དེ་ནས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་འདི་སྙམ་དུ་བསམས་ཏེ།
en: The kiṃnara king Druma then thought,

source: བཅོམ་ལྡན་འདས་ཉིད་ཀྱི་རྫུ་འཕྲུལ་གྱིས་སམ། གཞན་བྱང་ཆུབ་སེམས་དཔའི་རྫུ་འཕྲུལ་གྱིས་བདག་གི་གནས་ནས། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་གཤེགས་པ་ནི་བདག་གི་ཆ་མ་ཡིན་གྱིས་བདག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པའི་ལས་ཀྱི་ཕྱིར་ཤིང་རྟ་གང་ལ་བཅོམ་ལྡན་འདས་བྱང་ཆུབ་སེམས་དཔའི་དགེ་འདུན་དང་བཅས་པ་དང་ཉན་ཐོས་ཀྱི་དགེ་འདུན་དང་བཅས་པར་བཞུགས་པ་དེ་ལྟ་བུའི་ཤིང་རྟ་བཀོད་པ་བསྒྲུབས་ཏེ
en: “It would be improper for me to let the Blessed One and the bodhisattvas travel from my abode to Vulture Peak Mountain through their own miraculous powers . As an act of worship to the Thus-Gone One, I shall therefore manifest a chariot in which the Blessed One, his saṅgha of bodhisattvas, and his saṅgha of hearers can sit, and

source: ཤིང་རྟ་དེ་ཡང་བདག་འཁོར་དང་བཅས་པས་དྲངས་ནས།
en: I shall then personally pull the chariot with my retinue.

source: དེ་ལྟར་ན་བདག་གིས་དེ་བཞིན་གཤེགས་པ་ལ་མཆོད་པ་བྱས་པར་འགྱུར་སྙམ་མོ། །
en: This is how I will worship the Thus-Gone One!”

source: དེ་ནས་མི་འམ་ཅིའི་རྒྱལ་པོ་སྡོང་པོས་ཡིད་ལས་བྱུང་བ་ལྷའི་རིན་པོ་ཆེ་སྣ་བདུན་གྱི་ཤིང་རྟ་འཕང་དུ་དཔག་ཚད་ལྔ་ཁྱོན་དུ་དཔག་ཚད་ལྔ་པ། ཁ་ཁྱེར་རིན་པོ་ཆེ་སྣ་ཚོགས་ཀྱིས་བསྐོར་བ་ཤིང་ལྗོན་པ་སྣ་ཚོགས་ཀྱིས་ལེགས་པར་བརྒྱན་པ་སྟེང་དུ་རིན་པོ་ཆེའི་དྲ་བ་བྲེས་པ། རིན་པོ་ཆེའི་སྐུད་པ་མིག་མངས་རིས་སུ་བྲེས་པ་མངོན་པར་སྤྲུལ་ནས་
en: The kiṃnara king Druma then mentally emanated a divine chariot made of the seven precious substances. It was five leagues high and five leagues wide, surrounded by a railing made of precious gems, and adorned with different kinds of trees. It was decorated on top with a web of gems and a lattice made of stringed jewels.

source: ཤིང་རྟ་དེ་ལ་བཅོམ་ལྡན་འདས་ཀྱི་གདན་སེང་གེའི་ཁྲི་བཀྲ་བ་བལྟ་ན་སྡུག་པ། འཕང་དུ་མི་བདུན་ཡོད་པ། རས་བཅོས་མ་ཟུང་བརྒྱ་སྟོང་མང་པོ་བཀྲམ་པ་མངོན་པར་སྤྲུལ།
en: Within the chariot, he emanated a majestic and beautiful lion throne as high as seven men on which many hundreds of thousands of layers of fine fabrics were spread.

source: བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་དང་ཉན་ཐོས་ཀྱི་དགེ་འདུན་ཐམས་ཅད་ཀྱི་སྟན་ཡང་སོ་སོར་མངོན་པར་སྤྲུལ།
en: He also emanated seats for all the bodhisattvas and for the entire saṅgha of hearers.
